8evgeny/GIT/7_Camera/Project_Keil_Camera/SPL/MDR32F2C10/inc/MDR32F2C10_can.h
/**
  ******************************************************************************
  * @file    MDR32F2C10_can.h
  * @author  Milandr Application Team
  * @version V1.0.1
  * @date    11/11/2020
  * @brief   This file contains all the functions prototypes for the CAN
  *          firmware library.
  ******************************************************************************
  * <br><br>
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, MILANDR SHALL NOT BE HELD LIABLE FOR ANY DIRECT, INDIRECT
  * OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2021 Milandr</center></h2>
  ******************************************************************************
  * FILE MDR32F2C10_can.h
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MDR32F2C10_CAN_H
#define __MDR32F2C10_CAN_H

/* Includes ------------------------------------------------------------------*/
#include "MDR32F2C10_config.h"

/** @addtogroup __MDR32F2C10_StdPeriph_Driver MDR32F2C10 Standard Peripherial Driver
  * @{
  */

/** @addtogroup CAN CAN
  * @{
  */

/** @defgroup CAN_Exported_Types CAN Exported Types
  * @{
  */

/**
  * @brief  CAN init structure definition
  */

typedef struct
{
  uint8_t  CAN_ROP;                        /*!< Enables or disables own packets reception.
                                                This parameter can be a value of FunctionalState */
  uint8_t  CAN_SAP;                        /*!< Enables or disables sending ACK on own packets.
                                                This parameter can be a value of FunctionalState */
  uint8_t  CAN_STM;                        /*!< Enables or disables Self Test mode.
                                                This parameter can be a value of FunctionalState */
  uint8_t  CAN_ROM;                        /*!< Enables or disables Read Only mode.
                                                This parameter can be a value of FunctionalState */
  uint32_t CAN_PSEG;                       /*!< Specifies the Propagation time.
                                                This parameter is one of @ref CAN_Propagation_time values. */
  uint32_t CAN_SEG1;                       /*!< Specifies the Phase Segment 1 time.
                                                This parameter is one of @ref CAN_Phase_Segment1_time values. */
  uint32_t CAN_SEG2;                       /*!< Specifies the Phase Segment 2 time.
                                                This parameter is one of @ref CAN_Phase_Segment2_time values. */
  uint32_t CAN_SJW;                        /*!< Specifies the Synchronizations jump width time.
                                                This parameter is one of @ref CAN_Synch_jump_width_time values. */
  uint32_t CAN_SB;                         /*!< Specifies the Sampling mode.
                                                This parameter is one of @ref CAN_Sampling_mode */
  uint16_t CAN_BRP;                        /*!< Specifies the System Clock Prescaler. Used to calculate Time Quanta
                                                by the following algorithm:
                                                CLK = PCLK/(BRP + 1)
                                                TQ(microsec) = (BRP + 1)/CLK(MHz) */
  uint8_t CAN_OVER_ERROR_MAX;              /*!< Specifies the upper limit for TEC / REC error counters before
                                                ERROR_OVER flag is set. */
}CAN_InitTypeDef;


/**
  * @brief  CAN Buffer Data container definition
  */

typedef uint32_t CAN_DataTypeDef[2];


/**
  * @brief  CAN Transmitted message structure definition
  */

typedef struct
{
  uint32_t ID;                             /*!< Specifies the full (Standard or Extended) identifier.
                                                To set Standard ID, the macro CAN_STDID_TO_EXTID should
                                                be used. To get Standard ID use CAN_EXTID_TO_STDID macro.
                                                @ref CAN_ID_conversion
                                                This parameter can be a value between 0 to 0x1FFFFFFF. */
  uint8_t PRIOR_0;                         /*!< Specifies sending priority.
                                                This parameter can be a value of FunctionalState. */
  uint8_t IDE;                             /*!< Specifies the type of identifier for the message that will be transmitted.
                                                This parameter can be a value of @ref CAN_identifier_type */
  uint8_t DLC;                             /*!< Specifies the length of the frame that will be transmitted.
                                                This parameter can be a value between 0 to 8 */
  CAN_DataTypeDef Data;                    /*!< Contains the data to be transmitted. */
}CAN_TxMsgTypeDef;

/**
  * @brief  CAN Remote Transfer Request structure definition
  */

typedef struct
{
  uint32_t ID;                             /*!< Specifies the full (Standard or Extended) identifier.
                                                To set Standard ID, the macro CAN_STDID_TO_EXTID should
                                                be used. To get Standard ID use CAN_EXTID_TO_STDID macro.
                                                @ref CAN_ID_conversion
                                                This parameter can be a value between 0 to 0x1FFFFFFF. */
  uint8_t PRIOR_0;                         /*!< Specifies sending priority.
                                                This parameter can be a value of FunctionalState. */
  uint8_t IDE;                             /*!< Specifies the type of identifier for the message that will be transmitted.
                                                This parameter can be a value of @ref CAN_identifier_type */
}CAN_RTRMessageTypeDef;

/**
  * @brief  CAN Remote Transfer Request Reply structure definition
  */

typedef struct
{
  uint32_t ID;                             /*!< Specifies the full (Standard or Extended) identifier.
                                                To set Standard ID, the macro CAN_STDID_TO_EXTID should
                                                be used. To get Standard ID use CAN_EXTID_TO_STDID macro.
                                                @ref CAN_ID_conversion
                                                This parameter can be a value between 0 to 0x1FFFFFFF. */
  uint8_t IDE;                             /*!< Specifies the type of identifier for the message that will be transmitted.
                                                This parameter can be a value of @ref CAN_identifier_type */
  uint8_t DLC;                             /*!< Specifies the length of the frame that will be transmitted.
                                                This parameter can be a value between 0 to 8 */
  CAN_DataTypeDef Data;                    /*!< Contains the data to be transmitted. */
}CAN_RTRReplyTypeDef;

/**
  * @brief  CAN Received message header structure definition
  */

typedef struct
{
  uint32_t ID;                             /*!< Specifies the full (Standard or Extended) identifier.
                                                To set Standard ID, the macro CAN_STDID_TO_EXTID should
                                                be used. To get Standard ID use CAN_EXTID_TO_STDID macro.
                                                @ref CAN_ID_conversion
                                                This parameter can be a value between 0 to 0x1FFFFFFF. */
  uint8_t OVER_EN;                         /*!< Specifies if the received message could be rewritten.
                                                This parameter can be a value of FunctionalState. */
  uint8_t IDE;                             /*!< Specifies the type of identifier for the message that will be received.
                                                This parameter can be a value of @ref CAN_identifier_type */
  uint8_t DLC;                             /*!< Specifies the length of the frame that will be transmitted.
                                                This parameter can be a value between 0 to 8 */
}CAN_RxMsgHeaderTypeDef;

/**
  * @brief  CAN Received message structure definition
  */

typedef struct
{
  CAN_RxMsgHeaderTypeDef Rx_Header;        /*!< Contains message header. */
  CAN_DataTypeDef Data;                    /*!< Contains received data. */
}CAN_RxMsgTypeDef;

/**
  * @brief  CAN filter init structure definition
  */

typedef struct
{
  uint32_t Filter_ID;                      /*!< Specifies standard identifier for the filter.
                                                This parameter can be a value between 0 to 0x1FFFFFFF. */
  uint32_t Mask_ID;                        /*!< Specifies standard identifier for the mask.
                                                This parameter can be a value between 0 to 0x1FFFFFFF. */
}CAN_FilterInitTypeDef;

/** @} */ /* End of group CAN_Exported_Types */


